Extensions/АБ/Catalogs/ДокументыПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДокументыПредприятия</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_ВидАгентскогоДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАгентскихДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_КоличествоДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_НалогообложениеНДСОпределяетсяВДокументе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПроцентНеустойки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ВариантДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УВМ_ВариантыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ТипНеустойки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УВМ_ТипыНеустойки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Бессрочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВопросДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВременныйНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистрационныйНомер</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дело</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистрационныйНомер</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПлощадьНежилогоПомещения</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПлощадьЗдания</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ЭтажЗдания</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_КадастровыйНомерЗдания</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_КадастровыйНомерУчастка</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_АдресОбъекта</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УВМ_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПередаваемоеОборудование</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ОснованиеПраваСобственности</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_СрокПередачиОбъектаАрендодателем</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_СрокПринятияОбъектаАрендатором</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ЕжемесячнаяПостояннаяЧастьАренднойПлаты</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_НДСВСоставеАренднойПлаты</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_АренднаяПлатаЗаПользованиеОборудованием</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ОснащениеИмущества</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ДополнительноПереданныеДокументыИПредметы</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПоказанияПриборовУчётаНаМоментПередачи</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Стороны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаПодписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаименованияСторон</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подписал</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подписан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сторона</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УВМ_Основание</Name>
							<Comment>//Миляев 293293</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.АБ_ОтветственныеЛицаОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УВМ_Почта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Установил</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/АБ/Catalogs/ВидыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыДокументов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_СкрыватьПолеТипНеустойки</Name>
					<Comment>задача 330575</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_Скрыть</Name>
					<Comment>Скрывать поле "ФормаДокумента" на карточке документов этого вида</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УВМ_ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УВМ_ВариантыДоговоров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантДоговора</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УВМ_ВариантыДоговоров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/АБ/CommonModules/РаботаСИнтегрированнымиСистемами/Ext/Module.bsl
&ИзменениеИКонтроль("ОбработкаОбъектаПередЗаполнением")
Процедура АБ_ОбработкаОбъектаПередЗаполнением(ОбъектДО, ПравилоЗагрузки, ЗначенияИзШаблона)

	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ОсновнойСотрудникТекущегоПользователя = Сотрудники.ОсновнойСотрудникПользователя();
	ОбъектДО.ДополнительныеСвойства.Вставить("ТекущаяДата", ТекущаяДата);
	ОбъектДО.ДополнительныеСвойства.Вставить("ТекущийПользователь", ТекущийПользователь);
	ОбъектДО.ДополнительныеСвойства.Вставить(
	"ОсновнойСотрудникТекущегоПользователя",
	ОсновнойСотрудникТекущегоПользователя);

	Если ТипЗнч(ОбъектДО) = Тип("СправочникОбъект.ДокументыПредприятия") Тогда

		ОбъектДО.ДополнительныеСвойства.Вставить("НачальныйРегистрационныйНомер", ОбъектДО.РегистрационныйНомер);
#Вставка
		// + СБит 2026-06-23 #УВМ 334435
		ОбъектДО.ОбменДанными.Загрузка = Истина;
		// - СБит 2026-06-23 #УВМ
#КонецВставки

		Если ЗначениеЗаполнено(ПравилоЗагрузки.Шаблон) Тогда
			// Получение данных из шаблона.
			Если ОбъектДО.Шаблон <> ПравилоЗагрузки.Шаблон Тогда
				ОбъектДО.Шаблон = ПравилоЗагрузки.Шаблон;
			КонецЕсли;
			ЗначенияИзШаблона = Новый Структура("Документ, СтатьиДДС",
			Справочники.ДокументыПредприятия.СоздатьЭлемент(),
			ОбработкаЗапросовXDTOДокументы.ТаблицаСтатьиДвиженияДенежныхСредств());
			ЗначенияИзШаблона.Документ.ВидДокумента = ПравилоЗагрузки.ВидДокумента;
			ШаблоныДокументов.ЗаполнитьРеквизитыДокументаПоШаблону(
			ПравилоЗагрузки.Шаблон,
			ЗначенияИзШаблона.Документ);
			ШаблоныДокументов.ЗаполнитьСтатьиДДСДокументаПоШаблону(
			ПравилоЗагрузки.Шаблон,
			ЗначенияИзШаблона.СтатьиДДС,
			ЗначенияИзШаблона.Документ.Сумма,
			ЗначенияИзШаблона.Документ.СуммаНДС);
		КонецЕсли;

		ЗаполнятьПоШаблону = Не ЗначениеЗаполнено(ОбъектДО.Ссылка) И ЗначениеЗаполнено(ОбъектДО.Шаблон);
		ОбъектДО.ДополнительныеСвойства.Вставить("ЗаполнятьПоШаблону", ЗаполнятьПоШаблону);

		Если ЗначениеЗаполнено(ПравилоЗагрузки.ВидДокумента)
			И ОбъектДО.ВидДокумента <> ПравилоЗагрузки.ВидДокумента Тогда
			ОбъектДО.ВидДокумента = ПравилоЗагрузки.ВидДокумента;
#Вставка
			// + СБит 2026-06-22 #УВМ 334435
			Если НЕ ЗначениеЗаполнено(ОбъектДО.УВМ_ВариантДоговора) Тогда
				Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
				|	ВидыДокументовУВМ_ВариантыДоговоров.ВариантДоговора КАК УВМ_ВариантДоговора
				|ИЗ
				|	Справочник.ВидыДокументов.УВМ_ВариантыДоговоров КАК ВидыДокументовУВМ_ВариантыДоговоров
				|ГДЕ
				|	ВидыДокументовУВМ_ВариантыДоговоров.Ссылка = &Ссылка"); 
				Запрос.УстановитьПараметр("Ссылка", ОбъектДО.ВидДокумента);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					ОбъектДО.УВМ_ВариантДоговора = Выборка.УВМ_ВариантДоговора;
				КонецЕсли;	 
			КонецЕсли;
			// - СБит 2026-06-22 #УВМ
#КонецВставки
		КонецЕсли;

		КэшВидаДокумента = Делопроизводство.КэшВидаДокумента(ОбъектДО.ВидДокумента);
		ОбъектДО.ДополнительныеСвойства.Вставить("КэшВидаДокумента", КэшВидаДокумента);

		Если КэшВидаДокумента.ЯвляетсяВходящейКорреспонденцией
			Или КэшВидаДокумента.ЯвляетсяИсходящейКорреспонденцией Тогда
			// Получение параметров корреспонденции.
			ПараметрыКорреспонденции = ОбработкаЗапросовXDTOДокументы.ПараметрыКорреспонденцииДокумента(
			ОбъектДО,
			КэшВидаДокумента);
			ОбработкаЗапросовXDTOДокументы.ЗаполнитьПараметрыКорреспонденцииИзДокумента(
			ОбъектДО,
			ПараметрыКорреспонденции);
			ОбъектДО.ДополнительныеСвойства.Вставить("ПараметрыКорреспонденции", ПараметрыКорреспонденции);
		КонецЕсли;

		Связи = Новый ТаблицаЗначений;
		Связи.Колонки.Добавить("СвязанныйОбъект");
		Связи.Колонки.Добавить("ТипСвязи");
		ОбъектДО.ДополнительныеСвойства.Вставить("Связи", Связи);

	КонецЕсли;

КонецПроцедуры
